## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 9 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              {
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "volumesFrom": [],
                "essential": true,
                "name": "performance test",
                "image": "${aws_ecr_repository.performance-test.repository_url}",
                
                "environment": [
                  {
                    "name": "DEFAULT_DOMAIN",
                    "value": "${DEFAULT_DOMAIN}"
                  },
                ],
                "secrets": [
                  {
                    "name": "S3_UPLOADS_BUCKET",
                    "valueFrom": "${S3_UPLOADS_BUCKET}"
                  },
                  {
                    "name": "S3_UPLOADS_KEY",
                    "valueFrom": "${S3_UPLOADS_KEY}"
                  },
                  {
                    "name": "S3_UPLOADS_SECRET",
                    "valueFrom": "${S3_UPLOADS_SECRET}"
                  },
                ]
              }
            ]
        EOT
      + vars     = {
          + "AWS_LOGS_GROUP"         = "performance_test_cluster"
          + "AWS_LOGS_REGION"        = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX" = "performance_test_cluster-task"
        }
    }

  # aws_cloudwatch_log_group.perf_test_ecs_logs will be created
  + resource "aws_cloudwatch_log_group" "perf_test_ecs_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "performance_test_cluster"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.perf_test will be created
  + resource "aws_ecs_cluster" "perf_test" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "FARGATE",
        ]
      + id                 = (known after apply)
      + name               = "performance_test_cluster"
      + tags               = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all           = {
          + "CostCentre" = "notification-canada-ca-staging"
        }

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.perf_test_task will be created
  + resource "aws_ecs_task_definition" "perf_test_task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2"
      + execution_role_arn       = (known after apply)
      + family                   = "performance_test_cluster"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all                 = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.perf_test_ecs_task_get_ecr_image will be created
  + resource "aws_iam_policy" "perf_test_ecs_task_get_ecr_image" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "PerformanceTestEcsTaskGetEcrImage"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/performance-test"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.perf_test_ecs_task will be created
  + resource "aws_iam_role" "perf_test_ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "performance_test_cluster-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_ec2_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_ec2_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_get_ecr_image_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_get_ecr_image_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.perf_test_s3_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_s3_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/NotifyPerformanceTestS3Access"
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_lambda_function.performance-test will be updated in-place
  ~ resource "aws_lambda_function" "performance-test" {
        id                             = "performance-test"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:performance-test:2" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "TEST_AUTH_HEADER"                            = "apikey-v1 c55039fc-c0e1-44db-a14e-b6a669148ec6" -> "apikey-v1 00000000-0000-0000-0000-000000000000"
                # (10 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>